swarnmani/fmtr/arm_cortex/docs/AN11242/Projects/LPCXpresso/LPCXpresso/LPC11A14 Comparator Frequency Counter/Source/DeviceSupport/LPC11Axx.h

/****************************************************************************************************//**
 * @file     LPC11Axx.h
 *
 * @status   EXPERIMENTAL
 *
 * @brief    CMSIS Cortex-M0 Core Peripheral Access Layer Header File for
 *           default LPC11Axx Device Series
 *
 * @version  V0.1
 * @date     20. December 2011
 *
 * @note     Generated with SVDConv V2.6 Build 6c  on Tuesday, 20.12.2011 07:37:42
 *
 *           from CMSIS SVD File 'LPC11Axxv0.1.xml' Version 0.1,
 *           created on Tuesday, 20.12.2011 15:36:19, last modified on Tuesday, 20.12.2011 15:36:20
 *
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup LPC11Axx
  * @{
  */

#ifndef __LPC11AXX_H__
#define __LPC11AXX_H__

#ifdef __cplusplus
extern "C" {
#endif 



/********************************************
** Start of section using anonymous unions **
*********************************************/

#if defined(__ARMCC_VERSION)
  #pragma push
  #pragma anon_unions
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma push
  #pragma language=extended
#else
  #error Not supported compiler type
#endif


 /* Interrupt Number Definition */

typedef enum {
// -------------------------  Cortex-M0 Processor Exceptions Numbers  -----------------------------
  Reset_IRQn                        = -15,  /*!<   1  Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn               = -14,  /*!<   2  Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn                    = -13,  /*!<   3  Hard Fault, all classes of Fault */
  SVCall_IRQn                       =  -5,  /*!<  11  System Service Call via SVC instruction */
  DebugMonitor_IRQn                 =  -4,  /*!<  12  Debug Monitor                    */
  PendSV_IRQn                       =  -2,  /*!<  14  Pendable request for system service */
  SysTick_IRQn                      =  -1,  /*!<  15  System Tick Timer                */
// ---------------------------  LPC11Axx Specific Interrupt Numbers  ------------------------------
  PIN_INT0_IRQn                     =   0,  /*!<   0  PIN_INT0                         */
  PIN_INT1_IRQn                     =   1,  /*!<   1  PIN_INT1                         */
  PIN_INT2_IRQn                     =   2,  /*!<   2  PIN_INT2                         */
  PIN_INT3_IRQn                     =   3,  /*!<   3  PIN_INT3                         */
  PIN_INT4_IRQn                     =   4,  /*!<   4  PIN_INT4                         */
  PIN_INT5_IRQn                     =   5,  /*!<   5  PIN_INT5                         */
  PIN_INT6_IRQn                     =   6,  /*!<   6  PIN_INT6                         */
  PIN_INT7_IRQn                     =   7,  /*!<   7  PIN_INT7                         */
  GINT0_IRQn                        =   8,  /*!<   8  GINT0                            */
  GINT1_IRQn                        =   9,  /*!<   9  GINT1                            */
  CMP_IRQn                          =  10,  /*!<  10  CMP                              */
  DAC_IRQn                          =  11,  /*!<  11  DAC                              */
  RESERVED0_IRQn                    =  12,  /*!<  12  RESERVED0                        */
  RESERVED1_IRQn                    =  13,  /*!<  13  RESERVED1                        */
  SSP1_IRQn                         =  14,  /*!<  14  SSP1                             */
  I2C_IRQn                          =  15,  /*!<  15  I2C                              */
  TIMER_16_0_IRQn               = 16,       /*!< 16-bit Timer0 Interrupt                          */
  TIMER_16_1_IRQn               = 17,       /*!< 16-bit Timer1 Interrupt                          */
  TIMER_32_0_IRQn               = 18,       /*!< 32-bit Timer0 Interrupt                          */
  TIMER_32_1_IRQn               = 19,       /*!< 32-bit Timer1 Interrupt                          */
  SSP0_IRQn                         =  20,  /*!<  20  SSP0                             */
  USART_IRQn                        =  21,  /*!<  21  USART                            */
  RESERVED2_IRQn                    =  22,  /*!<  22  RESERVED2                        */
  RESERVED3_IRQn                    =  23,  /*!<  23  RESERVED3                        */
  ADC_IRQn                          =  24,  /*!<  24  ADC                              */
  WDT_IRQn                          =  25,  /*!<  25  WDT                              */
  BOD_IRQn                          =  26,  /*!<  26  BOD                              */
  FMC_IRQn                          =  27,  /*!<  27  FMC_IRQ                          */
  RESERVED4_IRQn                    =  28,  /*!<  28  RESERVED4                        */
  RESERVED5_IRQn                    =  29,  /*!<  29  RESERVED5                        */
  RESERVED6_IRQn                    =  30,  /*!<  30  RESERVED6                        */
  RESERVED7_IRQn                    =  31   /*!<  31  RESERVED7                        */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* Processor and Core Peripheral Section */ /* Configuration of the Cortex-M0 Processor and Core Peripherals */

#define __CM0_REV              0x0000       /*!< Cortex-M0 Core Revision               */
#define __MPU_PRESENT             0         /*!< MPU present or not                    */
#define __NVIC_PRIO_BITS          0         /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */

#include <core_cm0.h>                       /*!< Cortex-M0 processor and core peripherals */
#include "system_LPC11Axx.h"                /*!< LPC11Axx System                       */

/** @addtogroup Device_Peripheral_Registers
  * @{
  */


// ------------------------------------------------------------------------------------------------
// -----                                          I2C                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x I2C-bus controller Modification date=3/16/2011 Major revision=0 Minor revision=3  (I2C)
  */



