swarnmani/fmtr/arm_cortex/docs/AN11242/Projects/LPCXpresso/LPCXpresso/LPC11A14 Comparator Frequency Counter/Source/DeviceSupport/LPC11Axx.h
typedef struct { 
  __IO  uint32_t  CONSET; /*!< (@ 0x000) I2C Control Set Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is set. Writing a zero has no effect on the corresponding bit in the I2C control register.*/
  __I   uint32_t  STAT; /*!< (@ 0x004) I2C Status Register. During I2C operation, this register provides detailed status codes that allow software to determine the next action needed.*/
  __IO  uint32_t  DAT; /*!< (@ 0x008) I2C Data Register. During master or slave transmit mode, data to be transmitted is written to this register. During master or slave receive mode, data that has been received may be read from this register.*/
  __IO  uint32_t  ADR0; /*!< (@ 0x00C) I2C Slave Address Register 0. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address.*/
  __IO  uint32_t  SCLH; /*!< (@ 0x010) SCH Duty Cycle Register High Half Word. Determines the high time of the I2C clock.*/
  __IO  uint32_t  SCLL; /*!< (@ 0x014) SCL Duty Cycle Register Low Half Word. Determines the low time of the I2C clock. I2nSCLL and I2nSCLH together determine the clock frequency generated by an I2C master and certain times used in slave mode.*/
  __O   uint32_t  CONCLR; /*!< (@ 0x018) I2C Control Clear Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is cleared. Writing a zero has no effect on the corresponding bit in the I2C control register.*/
  __IO  uint32_t  MMCTRL; /*!< (@ 0x01C) Monitor mode control register.*/
    union{ 
      __IO   uint32_t  ADR[3]; /*!< (@ 0x020) I2C Slave Address Register. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address.*/
       struct{
           __IO  uint32_t ADR1;  
           __IO  uint32_t ADR2;  
           __IO  uint32_t ADR3;  
        };
    };
  __I   uint32_t  DATA_BUFFER; /*!< (@ 0x02C) Data buffer register. The contents of the 8 MSBs of the I2DAT shift register will be transferred to the DATA_BUFFER automatically after every nine bits (8 bits of data plus ACK or NACK) has been received on the bus.*/
    union{ 
      __IO   uint32_t  MASK[4]; /*!< (@ 0x030) I2C Slave address mask register. This mask register is associated with I2ADR0 to determine an address match. The mask register has no effect when comparing to the General Call address (0000000).*/
            struct{
          __IO  uint32_t MASK0;  
          __IO  uint32_t MASK1;  
          __IO  uint32_t MASK2;  
          __IO  uint32_t MASK3;  
         };
    };
 } LPC_I2C_Type; 


// ------------------------------------------------------------------------------------------------
// -----                                         WWDT                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x Windowed Watchdog Timer (WWDT) Modification date=3/16/2011 Major revision=0 Minor revision=3  (WWDT)
  */

typedef struct {                            /*!< (@ 0x40004000) WWDT Structure         */
  __IO uint32_t  MOD;                       /*!< (@ 0x40004000) Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer. */
  __IO uint32_t  TC;                        /*!< (@ 0x40004004) Watchdog timer constant register. This 24-bit register determines the time-out value. */
  __O  uint32_t  FEED;                      /*!< (@ 0x40004008) Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in WDTC. */
  __I  uint32_t  TV;                        /*!< (@ 0x4000400C) Watchdog timer value register. This 24-bit register reads out the current value of the Watchdog timer. */
  __IO uint32_t  CLKSEL;                    /*!< (@ 0x40004010) Watchdog clock select register. */
  __IO uint32_t  WARNINT;                   /*!< (@ 0x40004014) Watchdog Warning Interrupt compare value. */
  __IO uint32_t  WINDOW;                    /*!< (@ 0x40004018) Watchdog Window compare value. */
} LPC_WWDT_Type;


// ------------------------------------------------------------------------------------------------
// -----                                         USART                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x USART Modification date=3/22/2011 Major revision=0 Minor revision=4  (USART)
  */

typedef struct {                            /*!< (@ 0x40008000) USART Structure        */
  
  union {
    __IO uint32_t  DLL;                     /*!< (@ 0x40008000) Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1) */
    __O  uint32_t  THR;                     /*!< (@ 0x40008000) Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0) */
    __I  uint32_t  RBR;                     /*!< (@ 0x40008000) Receiver Buffer Register. Contains the next received character to be read. (DLAB=0) */
  } ;
  
  union {
    __IO uint32_t  IER;                     /*!< (@ 0x40008004) Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential USART interrupts. (DLAB=0) */
    __IO uint32_t  DLM;                     /*!< (@ 0x40008004) Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1) */
  } ;
  
  union {
    __O  uint32_t  FCR;                     /*!< (@ 0x40008008) FIFO Control Register. Controls USART FIFO usage and modes. */
    __I  uint32_t  IIR;                     /*!< (@ 0x40008008) Interrupt ID Register. Identifies which interrupt(s) are pending. */
  } ;
  __IO uint32_t  LCR;                       /*!< (@ 0x4000800C) Line Control Register. Contains controls for frame formatting and break generation. */
  __IO uint32_t  MCR;                       /*!< (@ 0x40008010) Modem Control Register. */
  __I  uint32_t  LSR;                       /*!< (@ 0x40008014) Line Status Register. Contains flags for transmit and receive status, including line errors. */
  __I  uint32_t  MSR;                       /*!< (@ 0x40008018) Modem Status Register. */
  __IO uint32_t  SCR;                       /*!< (@ 0x4000801C) Scratch Pad Register. Eight-bit temporary storage for software. */
  __IO uint32_t  ACR;                       /*!< (@ 0x40008020) Auto-baud Control Register. Contains controls for the auto-baud feature. */
  __IO uint32_t  ICR;                       /*!< (@ 0x40008024) IrDA Control Register. Enables and configures the IrDA (remote control) mode. */
  __IO uint32_t  FDR;                       /*!< (@ 0x40008028) Fractional Divider Register. Generates a clock input for the baud rate divider. */
  __IO uint32_t  OSR;                       /*!< (@ 0x4000802C) Oversampling Register. Controls the degree of oversampling during each bit time. */
  __IO uint32_t  TER;                       /*!< (@ 0x40008030) Transmit Enable Register. Turns off USART transmitter for use with software flow control. */
  __I  uint32_t  RESERVED0[3];
  __IO uint32_t  HDEN;                      /*!< (@ 0x40008040) Half duplex enable register. */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  SCICTRL;                   /*!< (@ 0x40008048) Smart Card Interface Control register. Enables and configures the Smart Card Interface feature. */
  __IO uint32_t  RS485CTRL;                 /*!< (@ 0x4000804C) RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes. */
  __IO uint32_t  RS485ADRMATCH;             /*!< (@ 0x40008050) RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode. */
  __IO uint32_t  RS485DLY;                  /*!< (@ 0x40008054) RS-485/EIA-485 direction control delay. */
  __IO uint32_t  SYNCCTRL;                  /*!< (@ 0x40008058) Synchronous mode control register. */
} LPC_USART_Type;


// ------------------------------------------------------------------------------------------------
// -----                                        CT16B0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x 16-bit counter/timers CT16B0/1 Modification date=3/16/2011 Major revision=0 Minor revision=3  (CT16B0)
  */

