swarnmani/fmtr/arm_cortex/docs/AN11242/Projects/LPCXpresso/LPCXpresso/LPC11A14 Comparator Frequency Counter/Source/DeviceSupport/LPC11Axx.h
typedef struct {                            /*!< (@ 0x4000C000) CT16B0 Structure       */
  __IO   uint32_t  IR; /*!< (@ 0x000) Interrupt Register. The IR can be written to clear interrupts. The IR can be read to identify which of eight possible interrupt sources are pending.*/
  __IO   uint32_t  TCR; /*!< (@ 0x004) Timer Control Register. The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR.*/
  __IO   uint32_t  TC; /*!< (@ 0x008) Timer Counter. The 16-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.*/
  __IO   uint32_t  PR; /*!< (@ 0x00C) Prescale Register. When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC.*/
  __IO   uint32_t  PC; /*!< (@ 0x010) Prescale Counter. The 16-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface.*/
  __IO   uint32_t  MCR; /*!< (@ 0x014) Match Control Register. The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs.*/
    union{ 
      __IO   uint32_t  MR[4]; /*!< (@ 0x018) Match Register. MR can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR matches the TC.*/
           struct{
         __IO  uint32_t MR0 ;  
         __IO  uint32_t MR1 ;  
         __IO  uint32_t MR2 ;  
         __IO  uint32_t MR3 ;  
        };
    };
  __IO   uint32_t  CCR; /*!< (@ 0x028) Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.*/
    union{ 
      __I   uint32_t  CR[4]; /*!< (@ 0x02C) Capture Register. CR is loaded with the value of TC when there is an event on the CT16B0_CAP input.*/
           struct{
          __I uint32_t CR0 ;  
          __I uint32_t CR1 ;  
          __I uint32_t CR2 ;  
          __I uint32_t CR3 ;  
        };
    };
  __IO   uint32_t  EMR; /*!< (@ 0x03C) External Match Register. The EMR controls the match function and the external match pins */
  __I    uint32_t  Reserved0[12]; 
  __IO   uint32_t  CTCR; /*!< (@ 0x070) Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.*/
  __IO   uint32_t  PWMC; /*!< (@ 0x074) PWM Control Register. The PWMCON enables PWM mode for the external match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].*/
 } LPC_CT16B0_Type; 

// ------------------------------------------------------------------------------------------------
// -----                                        CT32B0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x 32-bitcounter/timers CT32B0/1 Modification date=3/16/2011 Major revision=0 Minor revision=3  (CT32B0)
  */



typedef struct { 
  __IO   uint32_t  IR; /*!< (@ 0x000) Interrupt Register. The IR can be written to clear interrupts. The IR can be read to identify which of eight possible interrupt sources are pending.*/
  __IO   uint32_t  TCR; /*!< (@ 0x004) Timer Control Register. The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR.*/
  __IO   uint32_t  TC; /*!< (@ 0x008) Timer Counter. The 32-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.*/
  __IO   uint32_t  PR; /*!< (@ 0x00C) Prescale Register. When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC.*/
  __IO   uint32_t  PC; /*!< (@ 0x010) Prescale Counter. The 32-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface.*/
  __IO   uint32_t  MCR; /*!< (@ 0x014) Match Control Register. The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs.*/
    union{ 
      __IO   uint32_t  MR[4]; /*!< (@ 0x018) Match Register. MR can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR matches the TC.*/
           struct{
         __IO  uint32_t MR0 ;  
         __IO  uint32_t MR1 ;  
         __IO  uint32_t MR2 ;  
         __IO  uint32_t MR3 ;  
        };
    };
  __IO   uint32_t  CCR; /*!< (@ 0x028) Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.*/
    union{ 
      __I   uint32_t  CR[4]; /*!< (@ 0x02C) Capture Register. CR is loaded with the value of TC when there is an event on the CT32B_CAP0 input.*/
           struct{
          __I uint32_t CR0 ;  
          __I uint32_t CR1 ;  
          __I uint32_t CR2 ;  
          __I uint32_t CR3 ;  
        };
    };
  __IO   uint32_t  EMR; /*!< (@ 0x03C) External Match Register. The EMR controls the match function and the external match pins CT32Bn_MAT[3:0].*/
  __I    uint32_t  Reserved0[12]; 
  __IO   uint32_t  CTCR; /*!< (@ 0x070) Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.*/
  __IO   uint32_t  PWMC; /*!< (@ 0x074) PWM Control Register. The PWMCON enables PWM mode for the external match pins CT32Bn_MAT[3:0].*/
 } LPC_CT32B0_Type; 


// ------------------------------------------------------------------------------------------------
// -----                                          ADC                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x ADC Modification date=3/16/2011 Major revision=0 Minor revision=3  (ADC)
  */


