swarnmani/fmtr/arm_cortex/docs/AN11242/Projects/LPCXpresso/LPCXpresso/LPC11A14 Comparator Frequency Counter/Source/DeviceSupport/LPC11Axx.h
typedef struct { 
  __IO   uint32_t  CR; /*!< (@ 0x000) A/D Control Register. The CR register must be written to select the operating mode before A/D conversion can occur.*/
  __IO   uint32_t  GDR; /*!< (@ 0x004) A/D Global Data Register. Contains the result of the most recent A/D conversion.*/
  __IO   uint32_t  SEL; /*!< (@ 0x008) A/D Select Register. Selects between external pins and internal sources.*/
  __IO   uint32_t  INTEN; /*!< (@ 0x00C) A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt.*/
    union{ 
      __I   uint32_t  DR[8]; /*!< (@ 0x010) A/D Channel Data Register. This register contains the result of the most recent conversion completed on channel N*/
           struct{
          __I uint32_t DR0 ;  
          __I uint32_t DR1 ;  
          __I uint32_t DR2 ;  
          __I uint32_t DR3 ;  
          __I uint32_t DR4 ;  
          __I uint32_t DR5 ;  
          __I uint32_t DR6 ;  
          __I uint32_t DR7 ;  
        };
    };
  __I   uint32_t  STAT; /*!< (@ 0x030) A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag.*/
 } LPC_ADC_Type; 


// ------------------------------------------------------------------------------------------------
// -----                                          DAC                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief DAC (DAC)
  */

typedef struct {                            /*!< (@ 0x40024000) DAC Structure          */
  __IO uint32_t  CR;                        /*!< (@ 0x40024000) D/A control register   */
} LPC_DAC_Type;


// ------------------------------------------------------------------------------------------------
// -----                                          CMP                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Comparator (CMP)
  */

typedef struct {                            /*!< (@ 0x40028000) CMP Structure          */
  __IO uint32_t  CTL;                       /*!< (@ 0x40028000) Comparator control register */
  __IO uint32_t  LAD;                       /*!< (@ 0x40028004) Voltage ladder register */
} LPC_CMP_Type;


// ------------------------------------------------------------------------------------------------
// -----                                          FMC                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11Uxx Flashprogramming firmware Modification date=12/2/2011 Major revision=2 Minor revision=0  (FMC)
  */

typedef struct {                            /*!< (@ 0x4003C000) FMC Structure          */
  __I  uint32_t  RESERVED0[4];
  __IO uint32_t  FLASHCFG;                  /*!< (@ 0x4003C010) Flash memory access time configuration register */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  FMSSTART;                  /*!< (@ 0x4003C020) Signature start address register */
  __IO uint32_t  FMSSTOP;                   /*!< (@ 0x4003C024) Signature stop-address register */
  __I  uint32_t  RESERVED2;
    union{ 
      __I   uint32_t  FMSW[4];              /*!< (@ 0x4003C02C) Word 0 [31:0]          */
           struct{
         __I  uint32_t FMSW0;               /*!< (@ 0x4003C02C) Word 0 [31:0]          */
         __I  uint32_t FMSW1;               /*!< (@ 0x4003C030) Word 1 [63:32]         */
         __I  uint32_t FMSW2;               /*!< (@ 0x4003C034) Word 2 [95:64]         */  
         __I  uint32_t FMSW3;               /*!< (@ 0x4003C038) Word 3 [127:96]        */
        };
    };
  __I  uint32_t  RESERVED3[24];
  __IO uint32_t  EEMSSTART;                 /*!< (@ 0x4003C09C) EEPROM BIST start address register */
  __IO uint32_t  EEMSSTOP;                  /*!< (@ 0x4003C0A0) EEPROM BIST stop address register */
  __I  uint32_t  EEMSSIG;                   /*!< (@ 0x4003C0A4) EEPROM 24-bit BIST signature register */
  __I  uint32_t  RESERVED4[974];
  __I  uint32_t  FMSTAT;                    /*!< (@ 0x4003CFE0) Signature generation status register */
  __I  uint32_t  RESERVED5;
  __O  uint32_t  FMSTATCLR;                 /*!< (@ 0x4003CFE8) Signature generation status clear register */
} LPC_FMC_Type;


// ------------------------------------------------------------------------------------------------
// -----                                         SSP0                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x SSP/SPI Modification date=3/16/2011 Major revision=0 Minor revision=3  (SSP0)
  */

typedef struct {                            /*!< (@ 0x40040000) SSP0 Structure         */
  __IO uint32_t  CR0;                       /*!< (@ 0x40040000) Control Register 0. Selects the serial clock rate, bus type, and data size. */
  __IO uint32_t  CR1;                       /*!< (@ 0x40040004) Control Register 1. Selects master/slave and other modes. */
  __IO uint32_t  DR;                        /*!< (@ 0x40040008) Data Register. Writes fill the transmit FIFO, and reads empty the receive FIFO. */
  __I  uint32_t  SR;                        /*!< (@ 0x4004000C) Status Register        */
  __IO uint32_t  CPSR;                      /*!< (@ 0x40040010) Clock Prescale Register */
  __IO uint32_t  IMSC;                      /*!< (@ 0x40040014) Interrupt Mask Set and Clear Register */
  __I  uint32_t  RIS;                       /*!< (@ 0x40040018) Raw Interrupt Status Register */
  __I  uint32_t  MIS;                       /*!< (@ 0x4004001C) Masked Interrupt Status Register */
  __O  uint32_t  ICR;                       /*!< (@ 0x40040020) SSPICR Interrupt Clear Register */
} LPC_SSP0_Type;


// ------------------------------------------------------------------------------------------------
// -----                                         IOCON                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11Uxx I/O configuration Modification date=12/2/2011 Major revision=2 Minor revision=0  (IOCON)
  */

typedef struct {                            /*!< (@ 0x40044000) IOCON Structure        */
  __IO uint32_t  RESET_PIO0_0;              /*!< (@ 0x40044000) I/O configuration for pin RESET/PIO0_0 */
  __IO uint32_t  PIO0_1;                    /*!< (@ 0x40044004) I/O configuration for pin P0_1/RXD/CLKOUT/CT32B0_MAT2/SSEL0/CLKIN */
  __IO uint32_t  PIO0_2;                    /*!< (@ 0x40044008) I/O configuration for pin P0_2 / I2C_SCL /ACMPO / SWCLK / CT16B0_CAP0 / unused */
  __IO uint32_t  PIO0_3;                    /*!< (@ 0x4004400C) I/O configuration for pinP0_3 / I2C_SDA /ACMPO / SWIO / CT16B1_CAP0 / unused / */
  __IO uint32_t  PIO0_4;                    /*!< (@ 0x40044010) I/O configuration for pin P0_4 / unused / AOUT /CT16B0_MAT1 / SSP0_MOSI / unused */
  __IO uint32_t  SWCLK_PIO0_5;              /*!< (@ 0x40044014) I/O configuration for pin TCK / P0_5 / VDDCMP /CT16B0_MAT2 / SSP0_SCLK / unused */
  __IO uint32_t  TDI_PIO0_6;                /*!< (@ 0x40044018) I/O configuration for pin TDI / P0_6 / AD0 /CT32B0_MAT3 / SSP0_MISO / unused */
  __IO uint32_t  TMS_PIO0_7;                /*!< (@ 0x4004401C) I/O configuration for pin TMS/P0_7/AD1/CT32B1_CAP0/CT16B0_MAT0 */
  __IO uint32_t  TDO_PIO0_8;                /*!< (@ 0x40044020) I/O configuration for pin TDO/P0_8/AD2/CT32B1_MAT0/SCK1 */
  __IO uint32_t  TRST_PIO0_9;               /*!< (@ 0x40044024) I/O configuration for pin TRST/P0_9/AD3/CT32B1_MAT1/CT16B0_MAT1/CTS */
  __IO uint32_t  SWDIO_PIO0_10;             /*!< (@ 0x40044028) I/O configuration for pin SWDIO/P0_10/AD4/ CT32B1_MAT2/CT16B0_MAT2/RTS */
  __IO uint32_t  PIO0_11;                   /*!< (@ 0x4004402C) I/O configuration for pin P0_11(WAKEUP) /UART_SCLK / AD5 / CT32B1_MAT3 /CT32B0_CAP0 / unused */
  __IO uint32_t  PIO0_12;                   /*!< (@ 0x40044030) I/O configuration for pin P0_12 / UART_RXD /ACMPO / CT32B0_MAT0 / I2C_SCL / CLKIN / */
  __IO uint32_t  PIO0_13;                   /*!< (@ 0x40044034) I/O configuration for pin P0_13 / UART_TXD /ACMPI2 / CT32B0_MAT1 / I2C_SDA / unused */
  __IO uint32_t  PIO0_14;                   /*!< (@ 0x40044038) I/O configuration for pin P0_14/MISO1/AD6/CT32B0_CAP1/CT16B1_MAT1 */
  __IO uint32_t  PIO0_15;                   /*!< (@ 0x4004403C) I/O configuration for pin P0_15/TXD/AD7/CT32B0_CAP2/SDA */
  __IO uint32_t  PIO0_16;                   /*!< (@ 0x40044040) I/O configuration for pin P0_16 / ATRG0 /ACMPI3 / CT16B0_CAP1 / I2C_SCL / unused */
  __IO uint32_t  PIO0_17;                   /*!< (@ 0x40044044) I/O configuration for pin P0_17 / ATRG1 /ACMPI4 / CT16B0_CAP2 / CT16B0_MAT0 /unused  */
  __IO uint32_t  PIO0_18;                   /*!< (@ 0x40044048) I/O configuration for pin P0_18/SSEL0/CT16B0_CAP0/CT16B1_CAP1 */
  __IO uint32_t  PIO0_19;                   /*!< (@ 0x4004404C) I/O configuration for pin P0_19/CLKIN/CLKOUT/MOSI0/CT16B1_MAT0 */
  __IO uint32_t  PIO0_20;                   /*!< (@ 0x40044050) I/O configuration for pin P0_20 / unused /SSP0_SCLK / CT32B1_CAP0 / CT16B1_MAT2 /unused */
  __IO uint32_t  PIO0_21;                   /*!< (@ 0x40044054) I/O configuration for pin P0_21/CTS/ACMPO/CT32B1_CAP1/SCLK */
  __IO uint32_t  PIO0_22;                   /*!< (@ 0x40044058) I/O configuration for pin P0_22/MISO0/ACMPI5/CT32B1_MAT2/CT32B1_CAP2 */
  __IO uint32_t  PIO0_23;                   /*!< (@ 0x4004405C) I/O configuration for pin P0_23/RTS/ACMPO/CT32B0_CAP0/SCLK */
  __IO uint32_t  PIO0_24;                   /*!< (@ 0x40044060) I/O configuration for pin P0_24/SCL/CLKIN/CT16B1_CAP0 */
  __IO uint32_t  PIO0_25;                   /*!< (@ 0x40044064) I/O configuration for pin P0_25/SDA/SSEL1/CT16B1_MAT0 */
  __IO uint32_t  PIO0_26;                   /*!< (@ 0x40044068) I/O configuration for pin P0_26/TXD/MISO1/CT16B1_CAP1/CT32B0_CAP2 */
  __IO uint32_t  PIO0_27;                   /*!< (@ 0x4004406C) I/O configuration for pin P0_27/MOSI1/ACMPI1/CT32B1_MAT1/CT16B1_CAP2 */
  __IO uint32_t  PIO0_28;                   /*!< (@ 0x40044070) I/O configuration for pin P0_28 / UART_nDTR /SSP1_SSEL / CT32B0_CAP0 / unused / unused */
  __IO uint32_t  PIO0_29;                   /*!< (@ 0x40044074) I/O configuration for pin P0_29 / UART_nDSR /SSP1_SCLK / CT32B0_CAP1 / unused / unused */
  __IO uint32_t  PIO0_30;                   /*!< (@ 0x40044078) I/O configuration for pin P0_30 / UART_nRI /SSP1_MOSI / CT32B0_MAT0 / CT16B0_CAP0 /unused */
  __IO uint32_t  PIO0_31;                   /*!< (@ 0x4004407C) I/O configuration for pin P0_31 / UART_nRI /SSP1_MOSI / CT32B1_MAT0 / CT16B1_CAP1 /unused */
  __IO uint32_t  PIO1_0;                    /*!< (@ 0x40044080) I/O configuration for pin P1_0/DCD/SCK0/CT32B1_MAT3/CT16B0_MAT1 */
  __IO uint32_t  PIO1_1;                    /*!< (@ 0x40044084) I/O configuration for pin P1_1/DTR/SSEL0/CT32B1_MAT3/CT16B1_MAT0 */
  __IO uint32_t  PIO1_2;                    /*!< (@ 0x40044088) I/O configuration for pin 1_2/DSR/MISO0/CT16B1_MAT2/CT16B1_MAT1 */
  __IO uint32_t  PIO1_3;                    /*!< (@ 0x4004408C) I/O configuration for pin P1_3/RI/MOSI0/CT16B1_CAP0 */
  __IO uint32_t  PIO1_4;                    /*!< (@ 0x40044090) I/O configuration for pin P1_4/RxD/SSEL1/CT32B0_MAT1/CT32B1_CAP0/CT16B0_CAP1 */
  __IO uint32_t  PIO1_5;                    /*!< (@ 0x40044094) I/O configuration for pin P1_5/TxD/SCK1/CT32B0_MAT2/CT32B1_CAP1/CT16B0_CAP2 */
  __IO uint32_t  PIO1_6;                    /*!< (@ 0x40044098) I/O configuration for pin P1_6/RTS/MOSI1/CT32B0_MAT3/CT32B1_CAP2/CT16B0_MAT0 */
  __IO uint32_t  PIO1_7;                    /*!< (@ 0x4004409C) I/O configuration for pin P1_7/CTS/MOSI0/CT32B1_MAT1/CT16B0_MAT2/CT16B1_CAP2 */
  __IO uint32_t  PIO1_8;                    /*!< (@ 0x400440A0) I/O configuration for pin P1_8/RxD/MISO1/CT32B1_MAT0/CT16B1_MAT1 */
  __IO uint32_t  PIO1_9;                    /*!< (@ 0x400440A4) I/O configuration for pin P1_9/DCD/CT32B1_MAT2/CT16B1_MAT2 */
} LPC_IOCON_Type;


// ------------------------------------------------------------------------------------------------
// -----                                        SYSCON                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UMnnnnn Chapter title=LPC11Axx System configuration Modification date=4/13/2011 Major revision=0 Minor revision=12  (SYSCON)
  */

typedef struct {                            /*!< (@ 0x40048000) SYSCON Structure       */
  __IO uint32_t  SYSMEMREMAP;               /*!< (@ 0x40048000) System memory remap    */
  __IO uint32_t  PRESETCTRL;                /*!< (@ 0x40048004) Peripheral reset control */
  __IO uint32_t  SYSPLLCTRL;                /*!< (@ 0x40048008) System PLL control     */
  __I  uint32_t  SYSPLLSTAT;                /*!< (@ 0x4004800C) System PLL status      */
  __I  uint32_t  RESERVED0[5];
  __IO uint32_t  WDTOSCCTRL;                /*!< (@ 0x40048024) Watchdog oscillator control */
  __IO uint32_t  IRCCTRL;                   /*!< (@ 0x40048028) IRC oscillator control */
  __IO uint32_t  LFOSCCTRL;                 /*!< (@ 0x4004802C) LF oscillator control  */
  __IO uint32_t  SYSRSTSTAT;                /*!< (@ 0x40048030) System reset status register */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  SYSPLLCLKSEL;              /*!< (@ 0x40048040) System PLL clock source select */
  __IO uint32_t  SYSPLLCLKUEN;              /*!< (@ 0x40048044) System PLL clock source update enable */
  __I  uint32_t  RESERVED2[10];
  __IO uint32_t  MAINCLKSEL;                /*!< (@ 0x40048070) Main clock source select */
  __IO uint32_t  MAINCLKUEN;                /*!< (@ 0x40048074) Main clock source update enable */
  __IO uint32_t  SYSAHBCLKDIV;              /*!< (@ 0x40048078) System clock divider   */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  SYSAHBCLKCTRL;             /*!< (@ 0x40048080) System clock control   */
  __I  uint32_t  RESERVED4[4];
  __IO uint32_t  SSP0CLKDIV;                /*!< (@ 0x40048094) SSP0 clock divider     */
  __IO uint32_t  UARTCLKDIV;                /*!< (@ 0x40048098) UART clock divider     */
  __IO uint32_t  SSP1CLKDIV;                /*!< (@ 0x4004809C) SSP1 clock divider     */
  __I  uint32_t  RESERVED5[16];
  __IO uint32_t  CLKOUTSEL;                 /*!< (@ 0x400480E0) CLKOUT clock source select */
  __IO uint32_t  CLKOUTUEN;                 /*!< (@ 0x400480E4) CLKOUT clock source update enable */
  __IO uint32_t  CLKOUTDIV;                 /*!< (@ 0x400480E8) CLKOUT clock divider   */
  __I  uint32_t  RESERVED6[5];
  __I  uint32_t  PIOPORCAP0;                /*!< (@ 0x40048100) POR captured PIO status 0 */
  __I  uint32_t  PIOPORCAP1;                /*!< (@ 0x40048104) POR captured PIO status 1 */
  __I  uint32_t  RESERVED7[18];
  __IO uint32_t  BODR;                      /*!< (@ 0x40048150) Brown-Out Detect       */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  SYSTCKCAL;                 /*!< (@ 0x40048158) System tick counter calibration */
  __I  uint32_t  RESERVED9[6];
  __IO uint32_t  NMISRC;                    /*!< (@ 0x40048174) NMI Source Control     */
    union{ 
      __IO   uint32_t  PINSEL[8];           /*!< (@ 0x40048178) Pin Select Control     */
           struct{
         __IO  uint32_t PINSEL0;  
         __IO  uint32_t PINSEL1;
         __IO  uint32_t PINSEL2;  
         __IO  uint32_t PINSEL3;
         __IO  uint32_t PINSEL4;  
         __IO  uint32_t PINSEL5;
         __IO  uint32_t PINSEL6;  
         __IO  uint32_t PINSEL7;    
        };
    };
  __I  uint32_t  RESERVED10[40];
  __IO uint32_t  PDRUNCFG;                  /*!< (@ 0x40048238) Power configuration register */
  __I  uint32_t  RESERVED11[110];
  __I  uint32_t  DEVICE_ID;                 /*!< (@ 0x400483F4) Device ID              */
} LPC_SYSCON_Type;


// ------------------------------------------------------------------------------------------------
// -----                                     GPIO_PIN_INT                                     -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x GPIO Modification date=3/17/2011 Major revision=0 Minor revision=3  (GPIO_PIN_INT)
  */

typedef struct {                            /*!< (@ 0x4004C000) GPIO_PIN_INT Structure */
  __IO uint32_t  ISEL;                      /*!< (@ 0x4004C000) Pin Interrupt Mode register */
  __IO uint32_t  IENR;                      /*!< (@ 0x4004C004) Pin Interrupt Enable (Rising) register */
  __O  uint32_t  SIENR;                     /*!< (@ 0x4004C008) Set Pin Interrupt Enable (Rising) register */
  __O  uint32_t  CIENR;                     /*!< (@ 0x4004C00C) Clear Pin Interrupt Enable (Rising) register */
  __IO uint32_t  IENF;                      /*!< (@ 0x4004C010) Pin Interrupt Enable Falling Edge / Active Level register */
  __O  uint32_t  SIENF;                     /*!< (@ 0x4004C014) Set Pin Interrupt Enable Falling Edge / Active Level register */
  __O  uint32_t  CIENF;                     /*!< (@ 0x4004C018) Clear Pin Interrupt Enable Falling Edge / Active Level address */
  __IO uint32_t  RISE;                      /*!< (@ 0x4004C01C) Pin Interrupt Rising Edge register */
  __IO uint32_t  FALL;                      /*!< (@ 0x4004C020) Pin Interrupt Falling Edge register */
  __IO uint32_t  IST;                       /*!< (@ 0x4004C024) Pin Interrupt Status register */
} LPC_GPIO_PIN_INT_Type;


// ------------------------------------------------------------------------------------------------
// -----                                    GPIO_GROUP_INT0                                   -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x GPIO Modification date=3/17/2011 Major revision=0 Minor revision=3  (GPIO_GROUP_INT0)
  */
typedef struct { 
  __IO   uint32_t  CTRL; /*!< (@ 0x000) GPIO grouped interrupt control register*/
   __I  uint32_t  RESERVED0[7];
    union{ 
      __IO   uint32_t  PORT_POL[2]; /*!< (@ 0x020) GPIO grouped interrupt port 0 polarity register*/
           struct{
         __IO  uint32_t PORT_POL0 ;  
         __IO  uint32_t PORT_POL1 ;  
        };
    };
  __I  uint32_t  RESERVED1[6];
    union{ 
      __IO   uint32_t  PORT_ENA[2]; /*!< (@ 0x040) GPIO grouped interrupt port 0/1 enable register*/
           struct{
         __IO  uint32_t PORT_ENA0 ;  
         __IO  uint32_t PORT_ENA1 ;  
        };
    };
 } LPC_GPIO_GROUP_INT_Type; 

// ------------------------------------------------------------------------------------------------
// -----                                       GPIO_PORT                                      -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x GPIO Modification date=3/17/2011 Major revision=0 Minor revision=3  (GPIO_PORT)
  */
typedef struct { 
  __IO   uint8_t   B0[32]; /*!< (@ 0x0000) Byte pin registers port 0; pins PIO0_0 to PIO0_31*/
  __IO   uint8_t   B1[10]; /*!< (@ 0x0020) Byte pin registers port 1*/
  __I    uint8_t   RESERVED0[4054];
  __IO   uint32_t  W0[32]; /*!< (@ 0x1000) Word pin registers port 0*/
  __IO   uint32_t  W1[10]; /*!< (@ 0x1080) Word pin registers port 1*/
  __I    uint32_t  RESERVED1[982];
  __IO   uint32_t  DIR[2]; /*!< (@ 0x2000) Direction registers port 0/1*/
  __I    uint32_t  RESERVED2[30];
  __IO   uint32_t  MASK[2]; /*!< (@ 0x2080) Mask register port 0/1*/
  __I    uint32_t  RESERVED3[30];
  __IO   uint32_t  PIN[2]; /*!< (@ 0x2100) Portpin register port 0*/
  __I    uint32_t  RESERVED4[30]; 
  __IO   uint32_t  MPIN[2]; /*!< (@ 0x2180) Masked port register port 0/1*/
  __I    uint32_t  RESERVED5[30];
  __IO   uint32_t  SET[2]; /*!< (@ 0x2200) Write: Set register for port 0/1  Read: output bits for port 0/1*/
  __I    uint32_t  RESERVED6[30];
  __O    uint32_t  CLR[2]; /*!< (@ 0x2280) Clear port 0/1*/
  __I    uint32_t  RESERVED7[30];
  __O    uint32_t  NOT[2]; /*!< (@ 0x2300) Toggle port 0/1*/
 } LPC_GPIO_PORT_Type; 

/********************************************
** End of section using anonymous unions   **
*********************************************/

