swarnmani/fmtr/arm_cortex/docs/AN11242/Projects/LPCXpresso/LPCXpresso/LPC11A14 Comparator Frequency Counter/Source/DeviceSupport/LPC11Axx.h
#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define LPC_RAM_BASE          (0x10000000)
#define LPC_APB0_BASE         (0x40000000)
#define LPC_AHB_BASE          (0x50000000)

/* APB0 peripherals                                                           */
#define LPC_I2C_BASE          (LPC_APB0_BASE + 0x00000)
#define LPC_WWDT_BASE         (LPC_APB0_BASE + 0x04000)
#define LPC_USART_BASE        (LPC_APB0_BASE + 0x08000)
#define LPC_CT16B0_BASE       (LPC_APB0_BASE + 0x0C000)
#define LPC_CT16B1_BASE       (LPC_APB0_BASE + 0x10000)
#define LPC_CT32B0_BASE       (LPC_APB0_BASE + 0x14000)
#define LPC_CT32B1_BASE       (LPC_APB0_BASE + 0x18000)
#define LPC_ADC_BASE          (LPC_APB0_BASE + 0x1C000)
#define LPC_DAC_BASE          (LPC_APB0_BASE + 0x24000)
#define LPC_CMP_BASE          (LPC_APB0_BASE + 0x28000)
#define LPC_SSP0_BASE         (LPC_APB0_BASE + 0x40000)
#define LPC_IOCON_BASE        (LPC_APB0_BASE + 0x44000)
#define LPC_SYSCON_BASE       (LPC_APB0_BASE + 0x48000)
#define LPC_SSP1_BASE         (LPC_APB0_BASE + 0x58000)


/* AHB peripherals                                                            */
#define LPC_EEPROM_BASE           (LPC_FMC_BASE  + 0x00080)      
#define LPC_FMC_BASE              (LPC_APB0_BASE + 0x3C000)      
#define LPC_GPIO_PIN_INT_BASE     (LPC_APB0_BASE + 0x4C000)      
#define LPC_GPIO_GROUP_INT0_BASE  (LPC_APB0_BASE + 0x5C000)      
#define LPC_GPIO_GROUP_INT1_BASE  (LPC_APB0_BASE + 0x60000)      
#define LPC_GPIO_PORT_BASE        (LPC_AHB_BASE  + 0x00000)


// ------------------------------------------------------------------------------------------------
// -----                                Peripheral declaration                                -----
// ------------------------------------------------------------------------------------------------

#define LPC_I2C                   ((LPC_I2C_Type            *) LPC_I2C_BASE)
#define LPC_WWDT                  ((LPC_WWDT_Type           *) LPC_WWDT_BASE)
#define LPC_USART                 ((LPC_USART_Type          *) LPC_USART_BASE)
#define LPC_CT16B0                ((LPC_CT16B0_Type         *) LPC_CT16B0_BASE)
#define LPC_CT16B1                ((LPC_CT16B0_Type         *) LPC_CT16B1_BASE)
#define LPC_CT32B0                ((LPC_CT32B0_Type         *) LPC_CT32B0_BASE)
#define LPC_CT32B1                ((LPC_CT32B0_Type         *) LPC_CT32B1_BASE)
#define LPC_ADC                   ((LPC_ADC_Type            *) LPC_ADC_BASE)
#define LPC_DAC                   ((LPC_DAC_Type            *) LPC_DAC_BASE)
#define LPC_CMP                   ((LPC_CMP_Type            *) LPC_CMP_BASE)
#define LPC_FMC                   ((LPC_FMC_Type            *) LPC_FMC_BASE)
#define LPC_SSP0                  ((LPC_SSP0_Type           *) LPC_SSP0_BASE)
#define LPC_IOCON                 ((LPC_IOCON_Type          *) LPC_IOCON_BASE)
#define LPC_SYSCON                ((LPC_SYSCON_Type         *) LPC_SYSCON_BASE)
#define LPC_GPIO_PIN_INT          ((LPC_GPIO_PIN_INT_Type   *) LPC_GPIO_PIN_INT_BASE)
#define LPC_SSP1                  ((LPC_SSP0_Type           *) LPC_SSP1_BASE)
#define LPC_GPIO_GROUP_INT0       ((LPC_GPIO_GROUP_INT_Type *) LPC_GPIO_GROUP_INT0_BASE)
#define LPC_GPIO_GROUP_INT1       ((LPC_GPIO_GROUP_INT_Type *) LPC_GPIO_GROUP_INT1_BASE)
#define LPC_GPIO_PORT             ((LPC_GPIO_PORT_Type      *) LPC_GPIO_PORT_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group LPC11Axx */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif 


#endif  // __LPC11Axx_H__

